{
  "irVersion": "1.0",
  "specsHash": "sha256:69f429885ec9def4d0225dd92710ff9e2e3e5937c441f4dfa19f04371acf950a",
  "catalog": {
    "actors": [
      {
        "name": "Anonymous",
        "label": "匿名訪客",
        "description": "未登入的訪客使用者"
      },
      {
        "name": "Admin",
        "label": "管理員",
        "description": "新人或主辦方，擁有婚禮全功能管理權限，包含禮金統計與資料匯出"
      },
      {
        "name": "Receptionist",
        "label": "接待人員",
        "description": "婚禮現場接待人員（共用帳號），負責報到、禮金登記、喜餅發放、祝福審核等現場作業"
      },
      {
        "name": "Guest",
        "label": "賓客",
        "description": "受邀賓客，可自助報到、查看桌位、提交 RSVP 回覆、留言祝福、查看謝卡"
      }
    ],
    "aggregates": [
      {
        "name": "Admin",
        "label": "管理員",
        "events": [
          "AdminRegistered"
        ],
        "rootId": {
          "name": "userId",
          "type": "uuid",
          "label": "使用者 ID"
        },
        "description": "管理員帳號的註冊與身份管理"
      },
      {
        "name": "Wedding",
        "label": "婚禮",
        "events": [
          "WeddingCreated",
          "WeddingInfoUpdated",
          "LineOaConnected",
          "VenueLayoutConfigured",
          "EtiquetteSettingsUpdated",
          "EtiquetteWarningDismissed",
          "ThankYouCardTemplateSet",
          "ThankYouBatchSent",
          "WeddingSoftDeleted",
          "WeddingRestored",
          "GuestsBatchImported"
        ],
        "rootId": {
          "name": "weddingId",
          "type": "uuid",
          "label": "婚禮 ID"
        },
        "description": "婚禮基本資訊、LINE 連結、場地佈局、禮俗設定、謝卡範本與生命週期管理"
      },
      {
        "name": "ReceptionAccount",
        "label": "接待帳號",
        "events": [
          "ReceptionAccountCreated",
          "ReceptionAccountRemoved"
        ],
        "rootId": {
          "name": "accountId",
          "type": "uuid",
          "label": "帳號 ID"
        },
        "description": "接待人員共用帳號的建立與移除"
      },
      {
        "name": "Guest",
        "label": "賓客",
        "events": [
          "GuestAdded",
          "GuestUpdated",
          "GuestRemoved",
          "GuestRestored",
          "RsvpInvitationSent",
          "GuestLineBound",
          "RsvpSubmitted",
          "RsvpOverridden",
          "GuestSelfCheckedIn",
          "GuestCheckedInByReception",
          "GiftMoneyRecorded",
          "GiftMoneyUpdated",
          "CakeBoxDistributed",
          "CakeBoxAssignmentConfigured",
          "ThankYouCardCustomized",
          "ThankYouFallbackSent"
        ],
        "rootId": {
          "name": "guestId",
          "type": "uuid",
          "label": "賓客 ID"
        },
        "description": "賓客資料維護、RSVP、LINE 綁定、報到、禮金、喜餅發放與個人謝卡"
      },
      {
        "name": "Table",
        "label": "桌次",
        "events": [
          "TableAdded",
          "TableUpdated",
          "TableRemoved",
          "GuestSeated",
          "GuestUnseated"
        ],
        "rootId": {
          "name": "tableId",
          "type": "uuid",
          "label": "桌次 ID"
        },
        "description": "桌次的新增、更新、移除與座位安排"
      },
      {
        "name": "CakeBoxType",
        "label": "喜餅款式",
        "events": [
          "CakeBoxTypeAdded",
          "CakeBoxTypeUpdated",
          "CakeBoxTypeRemoved"
        ],
        "rootId": {
          "name": "cakeBoxTypeId",
          "type": "uuid",
          "label": "喜餅款式 ID"
        },
        "description": "喜餅款式的定義與管理"
      },
      {
        "name": "Blessing",
        "label": "祝福",
        "events": [
          "BlessingSubmitted",
          "BlessingApproved",
          "BlessingRejected"
        ],
        "rootId": {
          "name": "blessingId",
          "type": "uuid",
          "label": "祝福 ID"
        },
        "description": "賓客祝福留言的提交與審核"
      }
    ],
    "events": [
      {
        "name": "AdminRegistered",
        "data": {
          "type": "object",
          "properties": {
            "email": {
              "type": "string",
              "title": "Email",
              "format": "email",
              "description": "管理員電子郵件"
            },
            "userId": {
              "type": "string",
              "title": "使用者 ID",
              "format": "uuid",
              "description": "管理員帳號識別碼"
            },
            "displayName": {
              "type": "string",
              "title": "顯示名稱",
              "description": "管理員顯示名稱"
            }
          },
          "required": [
            "email",
            "userId",
            "displayName"
          ]
        },
        "label": "管理員已註冊",
        "description": "新管理員（新人/主辦）完成帳號註冊"
      },
      {
        "name": "WeddingCreated",
        "data": {
          "type": "object",
          "properties": {
            "date": {
              "type": "string",
              "title": "婚禮日期",
              "format": "date-time",
              "description": "婚禮舉辦日期時間"
            },
            "title": {
              "type": "string",
              "title": "婚禮名稱",
              "description": "婚禮顯示名稱"
            },
            "venue": {
              "type": "string",
              "title": "婚宴場地",
              "description": "婚宴場地名稱"
            },
            "address": {
              "type": "string",
              "title": "場地地址",
              "description": "場地完整地址"
            },
            "adminId": {
              "type": "string",
              "title": "管理員 ID",
              "format": "uuid",
              "description": "建立婚禮的管理員識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮唯一識別碼"
            }
          },
          "required": [
            "date",
            "title",
            "venue",
            "address",
            "adminId",
            "weddingId"
          ]
        },
        "label": "婚禮已建立",
        "description": "管理員建立新的婚禮場次"
      },
      {
        "name": "WeddingInfoUpdated",
        "data": {
          "type": "object",
          "properties": {
            "date": {
              "type": "string",
              "title": "婚禮日期",
              "format": "date-time",
              "description": "更新後的婚禮日期時間"
            },
            "venue": {
              "type": "string",
              "title": "婚宴場地",
              "description": "更新後的場地名稱"
            },
            "address": {
              "type": "string",
              "title": "場地地址",
              "description": "更新後的場地地址"
            },
            "mapLink": {
              "type": "string",
              "title": "地圖連結",
              "format": "uri",
              "description": "Google Maps 或導航連結"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮唯一識別碼"
            },
            "parkingInfo": {
              "type": "string",
              "title": "停車資訊",
              "description": "停車場位置與注意事項"
            },
            "transportInfo": {
              "type": "string",
              "title": "交通指引",
              "description": "交通方式說明"
            }
          },
          "required": [
            "date",
            "venue",
            "address",
            "mapLink",
            "weddingId",
            "parkingInfo",
            "transportInfo"
          ]
        },
        "label": "婚禮資訊已更新",
        "description": "管理員更新婚禮資訊（時間、地點、交通指引等）"
      },
      {
        "name": "LineOaConnected",
        "data": {
          "type": "object",
          "properties": {
            "oaName": {
              "type": "string",
              "title": "官方帳號名稱",
              "description": "LINE 官方帳號顯示名稱"
            },
            "channelId": {
              "type": "string",
              "title": "Channel ID",
              "description": "LINE Messaging API Channel ID"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            }
          },
          "required": [
            "oaName",
            "channelId",
            "weddingId"
          ]
        },
        "label": "LINE 官方帳號已連結",
        "description": "管理員將 LINE 官方帳號連結至婚禮"
      },
      {
        "name": "ReceptionAccountCreated",
        "data": {
          "type": "object",
          "properties": {
            "username": {
              "type": "string",
              "title": "帳號名稱",
              "description": "接待人員登入帳號"
            },
            "accountId": {
              "type": "string",
              "title": "帳號 ID",
              "format": "uuid",
              "description": "接待帳號識別碼"
            },
            "createdBy": {
              "type": "string",
              "title": "建立者 ID",
              "format": "uuid",
              "description": "建立帳號的管理員識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            }
          },
          "required": [
            "username",
            "accountId",
            "createdBy",
            "weddingId"
          ]
        },
        "label": "接待帳號已建立",
        "description": "管理員為婚禮建立接待人員共用帳號"
      },
      {
        "name": "ReceptionAccountRemoved",
        "data": {
          "type": "object",
          "properties": {
            "accountId": {
              "type": "string",
              "title": "帳號 ID",
              "format": "uuid",
              "description": "被移除的接待帳號識別碼"
            },
            "removedBy": {
              "type": "string",
              "title": "移除者 ID",
              "format": "uuid",
              "description": "執行移除的管理員識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            }
          },
          "required": [
            "accountId",
            "removedBy",
            "weddingId"
          ]
        },
        "label": "接待帳號已移除",
        "description": "管理員移除接待人員帳號"
      },
      {
        "name": "GuestAdded",
        "data": {
          "type": "object",
          "properties": {
            "diet": {
              "enum": [
                "meat",
                "vegetarian"
              ],
              "type": "string",
              "title": "飲食需求",
              "description": "葷食或素食"
            },
            "name": {
              "type": "string",
              "title": "賓客姓名",
              "description": "賓客全名"
            },
            "side": {
              "enum": [
                "groom",
                "bride"
              ],
              "type": "string",
              "title": "男方/女方",
              "description": "賓客歸屬方"
            },
            "notes": {
              "type": "string",
              "title": "備註",
              "description": "其他備註事項"
            },
            "contact": {
              "type": "string",
              "title": "聯絡方式",
              "description": "電話或其他聯絡資訊"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客唯一識別碼"
            },
            "category": {
              "type": "string",
              "title": "分類/輩分",
              "description": "賓客分類（如長輩、同事、朋友）"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            },
            "needChildSeat": {
              "type": "boolean",
              "title": "小孩椅",
              "description": "是否需要兒童座椅"
            }
          },
          "required": [
            "diet",
            "name",
            "side",
            "notes",
            "contact",
            "guestId",
            "category",
            "weddingId",
            "needChildSeat"
          ]
        },
        "label": "賓客已新增",
        "description": "管理員手動新增一位賓客"
      },
      {
        "name": "GuestsBatchImported",
        "data": {
          "type": "object",
          "properties": {
            "fileName": {
              "type": "string",
              "title": "檔案名稱",
              "description": "匯入的 Excel 檔案名稱"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "目標婚禮識別碼"
            },
            "importedBy": {
              "type": "string",
              "title": "匯入者 ID",
              "format": "uuid",
              "description": "執行匯入的使用者識別碼"
            },
            "importedCount": {
              "type": "integer",
              "title": "匯入數量",
              "description": "成功匯入的賓客數量"
            }
          },
          "required": [
            "fileName",
            "weddingId",
            "importedBy",
            "importedCount"
          ]
        },
        "label": "賓客已批次匯入",
        "description": "透過 Excel 匯入批次新增賓客"
      },
      {
        "name": "GuestUpdated",
        "data": {
          "type": "object",
          "properties": {
            "diet": {
              "enum": [
                "meat",
                "vegetarian"
              ],
              "type": "string",
              "title": "飲食需求",
              "description": "更新後的飲食需求"
            },
            "name": {
              "type": "string",
              "title": "賓客姓名",
              "description": "更新後的姓名"
            },
            "side": {
              "enum": [
                "groom",
                "bride"
              ],
              "type": "string",
              "title": "男方/女方",
              "description": "更新後的歸屬方"
            },
            "notes": {
              "type": "string",
              "title": "備註",
              "description": "更新後的備註"
            },
            "contact": {
              "type": "string",
              "title": "聯絡方式",
              "description": "更新後的聯絡資訊"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "category": {
              "type": "string",
              "title": "分類/輩分",
              "description": "更新後的分類"
            },
            "needChildSeat": {
              "type": "boolean",
              "title": "小孩椅",
              "description": "是否需要兒童座椅"
            }
          },
          "required": [
            "diet",
            "name",
            "side",
            "notes",
            "contact",
            "guestId",
            "category",
            "needChildSeat"
          ]
        },
        "label": "賓客已更新",
        "description": "管理員更新賓客資料"
      },
      {
        "name": "GuestRemoved",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "被移除的賓客識別碼"
            },
            "removedBy": {
              "type": "string",
              "title": "移除者 ID",
              "format": "uuid",
              "description": "執行移除的使用者識別碼"
            }
          },
          "required": [
            "guestId",
            "removedBy"
          ]
        },
        "label": "賓客已移除",
        "description": "賓客資料軟刪除"
      },
      {
        "name": "GuestRestored",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "被恢復的賓客識別碼"
            },
            "restoredBy": {
              "type": "string",
              "title": "恢復者 ID",
              "format": "uuid",
              "description": "執行恢復的使用者識別碼"
            }
          },
          "required": [
            "guestId",
            "restoredBy"
          ]
        },
        "label": "賓客已恢復",
        "description": "已軟刪除的賓客資料恢復"
      },
      {
        "name": "VenueLayoutConfigured",
        "data": {
          "type": "object",
          "properties": {
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "stageWidth": {
              "type": "number",
              "title": "舞台寬度",
              "description": "舞台的寬度"
            },
            "stageHeight": {
              "type": "number",
              "title": "舞台高度",
              "description": "舞台的高度"
            },
            "stagePositionX": {
              "type": "number",
              "title": "舞台 X 座標",
              "description": "舞台在平面圖的 X 位置"
            },
            "stagePositionY": {
              "type": "number",
              "title": "舞台 Y 座標",
              "description": "舞台在平面圖的 Y 位置"
            }
          },
          "required": [
            "weddingId",
            "stageWidth",
            "stageHeight",
            "stagePositionX",
            "stagePositionY"
          ]
        },
        "label": "場地佈局已設定",
        "description": "設定場地佈局（舞台位置等）"
      },
      {
        "name": "TableAdded",
        "data": {
          "type": "object",
          "properties": {
            "tableId": {
              "type": "string",
              "title": "桌次 ID",
              "format": "uuid",
              "description": "桌次唯一識別碼"
            },
            "capacity": {
              "enum": [
                10,
                12
              ],
              "type": "integer",
              "title": "座位數",
              "description": "每桌座位數（10 或 12 人）"
            },
            "positionX": {
              "type": "number",
              "title": "X 座標",
              "description": "桌次在場地平面圖的 X 位置"
            },
            "positionY": {
              "type": "number",
              "title": "Y 座標",
              "description": "桌次在場地平面圖的 Y 位置"
            },
            "tableName": {
              "type": "string",
              "title": "桌次名稱",
              "description": "桌次自訂名稱（如「主桌」）"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            }
          },
          "required": [
            "tableId",
            "capacity",
            "positionX",
            "positionY",
            "tableName",
            "weddingId"
          ]
        },
        "label": "桌次已新增",
        "description": "新增一張桌次（圓桌）"
      },
      {
        "name": "TableUpdated",
        "data": {
          "type": "object",
          "properties": {
            "tableId": {
              "type": "string",
              "title": "桌次 ID",
              "format": "uuid",
              "description": "桌次識別碼"
            },
            "capacity": {
              "enum": [
                10,
                12
              ],
              "type": "integer",
              "title": "座位數",
              "description": "更新後的座位數"
            },
            "positionX": {
              "type": "number",
              "title": "X 座標",
              "description": "更新後的 X 位置"
            },
            "positionY": {
              "type": "number",
              "title": "Y 座標",
              "description": "更新後的 Y 位置"
            },
            "tableName": {
              "type": "string",
              "title": "桌次名稱",
              "description": "更新後的桌次名稱"
            }
          },
          "required": [
            "tableId",
            "capacity",
            "positionX",
            "positionY",
            "tableName"
          ]
        },
        "label": "桌次已更新",
        "description": "更新桌次資訊（名稱、座位數、位置）"
      },
      {
        "name": "TableRemoved",
        "data": {
          "type": "object",
          "properties": {
            "tableId": {
              "type": "string",
              "title": "桌次 ID",
              "format": "uuid",
              "description": "被移除的桌次識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            }
          },
          "required": [
            "tableId",
            "weddingId"
          ]
        },
        "label": "桌次已移除",
        "description": "移除一張桌次"
      },
      {
        "name": "EtiquetteSettingsUpdated",
        "data": {
          "type": "object",
          "properties": {
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "elderNearMain": {
              "type": "boolean",
              "title": "長輩桌靠主桌",
              "description": "是否啟用長輩桌靠主桌規則"
            },
            "conflictWarning": {
              "type": "boolean",
              "title": "不可同桌警告",
              "description": "是否啟用不可同桌衝突警告"
            },
            "genderSeparation": {
              "type": "boolean",
              "title": "男女方分區",
              "description": "是否啟用男女方分區規則"
            },
            "mainTableNearStage": {
              "type": "boolean",
              "title": "主桌靠舞台",
              "description": "是否啟用主桌靠舞台規則"
            },
            "sameCategoryTogether": {
              "type": "boolean",
              "title": "同分類同桌",
              "description": "是否啟用同分類同桌規則"
            }
          },
          "required": [
            "weddingId",
            "elderNearMain",
            "conflictWarning",
            "genderSeparation",
            "mainTableNearStage",
            "sameCategoryTogether"
          ]
        },
        "label": "禮俗設定已更新",
        "description": "管理員更新禮俗建議引擎的開關設定"
      },
      {
        "name": "GuestSeated",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "tableId": {
              "type": "string",
              "title": "桌次 ID",
              "format": "uuid",
              "description": "指定桌次識別碼"
            },
            "seatNumber": {
              "type": "integer",
              "title": "座位號碼",
              "minimum": 1,
              "description": "座位編號"
            }
          },
          "required": [
            "guestId",
            "tableId",
            "seatNumber"
          ]
        },
        "label": "賓客已入座",
        "description": "將賓客分配至指定桌次與座位"
      },
      {
        "name": "GuestUnseated",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "tableId": {
              "type": "string",
              "title": "桌次 ID",
              "format": "uuid",
              "description": "原桌次識別碼"
            }
          },
          "required": [
            "guestId",
            "tableId"
          ]
        },
        "label": "賓客已離座",
        "description": "取消賓客的座位分配"
      },
      {
        "name": "EtiquetteWarningDismissed",
        "data": {
          "type": "object",
          "properties": {
            "warningId": {
              "type": "string",
              "title": "警告 ID",
              "format": "uuid",
              "description": "被覆寫的禮俗警告識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "dismissedBy": {
              "type": "string",
              "title": "覆寫者 ID",
              "format": "uuid",
              "description": "執行覆寫的管理員識別碼"
            },
            "warningType": {
              "type": "string",
              "title": "警告類型",
              "description": "禮俗警告的類型"
            }
          },
          "required": [
            "warningId",
            "weddingId",
            "dismissedBy",
            "warningType"
          ]
        },
        "label": "禮俗警告已覆寫",
        "description": "管理員覆寫（忽略）特定禮俗警告"
      },
      {
        "name": "CakeBoxTypeAdded",
        "data": {
          "type": "object",
          "properties": {
            "name": {
              "type": "string",
              "title": "款式名稱",
              "description": "喜餅款式名稱（如一般禮盒、豪華禮盒）"
            },
            "isDefault": {
              "type": "boolean",
              "title": "是否預設",
              "description": "是否為預設款式"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            },
            "description": {
              "type": "string",
              "title": "款式說明",
              "description": "喜餅款式的詳細說明"
            },
            "cakeBoxTypeId": {
              "type": "string",
              "title": "款式 ID",
              "format": "uuid",
              "description": "喜餅款式唯一識別碼"
            }
          },
          "required": [
            "name",
            "isDefault",
            "weddingId",
            "description",
            "cakeBoxTypeId"
          ]
        },
        "label": "喜餅款式已新增",
        "description": "管理員新增喜餅款式（預設或自訂）"
      },
      {
        "name": "CakeBoxTypeUpdated",
        "data": {
          "type": "object",
          "properties": {
            "name": {
              "type": "string",
              "title": "款式名稱",
              "description": "更新後的款式名稱"
            },
            "description": {
              "type": "string",
              "title": "款式說明",
              "description": "更新後的款式說明"
            },
            "cakeBoxTypeId": {
              "type": "string",
              "title": "款式 ID",
              "format": "uuid",
              "description": "喜餅款式識別碼"
            }
          },
          "required": [
            "name",
            "description",
            "cakeBoxTypeId"
          ]
        },
        "label": "喜餅款式已更新",
        "description": "管理員更新喜餅款式資訊"
      },
      {
        "name": "CakeBoxTypeRemoved",
        "data": {
          "type": "object",
          "properties": {
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "所屬婚禮識別碼"
            },
            "cakeBoxTypeId": {
              "type": "string",
              "title": "款式 ID",
              "format": "uuid",
              "description": "被移除的喜餅款式識別碼"
            }
          },
          "required": [
            "weddingId",
            "cakeBoxTypeId"
          ]
        },
        "label": "喜餅款式已移除",
        "description": "管理員移除喜餅款式"
      },
      {
        "name": "CakeBoxAssignmentConfigured",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "被指派的賓客識別碼（個別指派時）"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "cakeBoxTypeId": {
              "type": "string",
              "title": "款式 ID",
              "format": "uuid",
              "description": "指派的喜餅款式識別碼"
            },
            "assignmentRule": {
              "type": "string",
              "title": "指派規則",
              "description": "基於身分的指派規則描述（如「家人→大餅＋豪華禮盒」）"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "cakeBoxTypeId",
            "assignmentRule"
          ]
        },
        "label": "喜餅指派已設定",
        "description": "設定身分或賓客對應的喜餅款式"
      },
      {
        "name": "RsvpInvitationSent",
        "data": {
          "type": "object",
          "properties": {
            "channel": {
              "enum": [
                "line",
                "email",
                "manual"
              ],
              "type": "string",
              "title": "發送管道",
              "description": "邀請發送的管道"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "目標賓客識別碼"
            },
            "rsvpToken": {
              "type": "string",
              "title": "RSVP Token",
              "description": "專屬連結內的驗證 token"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            }
          },
          "required": [
            "channel",
            "guestId",
            "rsvpToken",
            "weddingId"
          ]
        },
        "label": "RSVP 邀請已發送",
        "description": "透過 LINE Bot 發送專屬 RSVP 連結給賓客"
      },
      {
        "name": "GuestLineBound",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "lineUserId": {
              "type": "string",
              "title": "LINE User ID",
              "description": "賓客的 LINE userId"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "lineUserId"
          ]
        },
        "label": "賓客 LINE 已綁定",
        "description": "賓客透過專屬連結綁定 LINE userId"
      },
      {
        "name": "RsvpSubmitted",
        "data": {
          "type": "object",
          "properties": {
            "diet": {
              "enum": [
                "meat",
                "vegetarian"
              ],
              "type": "string",
              "title": "飲食需求",
              "description": "葷食或素食"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "回覆的賓客識別碼"
            },
            "attending": {
              "enum": [
                "attending",
                "declined"
              ],
              "type": "string",
              "title": "出席意願",
              "description": "確定出席或婉拒"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "plusOneCount": {
              "type": "integer",
              "title": "攜伴人數",
              "minimum": 0,
              "description": "額外攜伴人數"
            },
            "needChildSeat": {
              "type": "boolean",
              "title": "小孩椅",
              "description": "是否需要兒童座椅"
            }
          },
          "required": [
            "diet",
            "guestId",
            "attending",
            "weddingId",
            "plusOneCount",
            "needChildSeat"
          ]
        },
        "label": "RSVP 已提交",
        "description": "賓客透過 LIFF 提交出席回覆"
      },
      {
        "name": "RsvpOverridden",
        "data": {
          "type": "object",
          "properties": {
            "reason": {
              "type": "string",
              "title": "覆寫原因",
              "description": "手動覆寫的原因說明"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "被覆寫的賓客識別碼"
            },
            "attending": {
              "enum": [
                "attending",
                "declined",
                "absent",
                "pending"
              ],
              "type": "string",
              "title": "出席狀態",
              "description": "覆寫後的出席狀態"
            },
            "overriddenBy": {
              "type": "string",
              "title": "覆寫者 ID",
              "format": "uuid",
              "description": "執行覆寫的管理員識別碼"
            }
          },
          "required": [
            "reason",
            "guestId",
            "attending",
            "overriddenBy"
          ]
        },
        "label": "RSVP 已覆寫",
        "description": "管理員手動覆寫賓客的 RSVP 回覆"
      },
      {
        "name": "GuestSelfCheckedIn",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "報到的賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "checkedInAt": {
              "type": "string",
              "title": "報到時間",
              "format": "date-time",
              "description": "自助報到的時間戳"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "checkedInAt"
          ]
        },
        "label": "賓客已自助報到",
        "description": "賓客掃共用 QRCode 輸入姓名完成自助報到"
      },
      {
        "name": "GuestCheckedInByReception",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "報到的賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "checkedInAt": {
              "type": "string",
              "title": "報到時間",
              "format": "date-time",
              "description": "接待報到的時間戳"
            },
            "checkedInBy": {
              "type": "string",
              "title": "接待人員 ID",
              "format": "uuid",
              "description": "執行報到的接待人員識別碼"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "checkedInAt",
            "checkedInBy"
          ]
        },
        "label": "賓客已由接待報到",
        "description": "接待人員在接待端為賓客完成報到"
      },
      {
        "name": "GiftMoneyRecorded",
        "data": {
          "type": "object",
          "properties": {
            "amount": {
              "type": "integer",
              "title": "禮金金額",
              "minimum": 0,
              "description": "禮金金額（新台幣）"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "recordedBy": {
              "type": "string",
              "title": "登記者 ID",
              "format": "uuid",
              "description": "登記禮金的接待人員識別碼"
            }
          },
          "required": [
            "amount",
            "guestId",
            "weddingId",
            "recordedBy"
          ]
        },
        "label": "禮金已登記",
        "description": "接待端登記賓客禮金金額"
      },
      {
        "name": "GiftMoneyUpdated",
        "data": {
          "type": "object",
          "properties": {
            "amount": {
              "type": "integer",
              "title": "禮金金額",
              "minimum": 0,
              "description": "更正後的禮金金額（新台幣）"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "updatedBy": {
              "type": "string",
              "title": "更正者 ID",
              "format": "uuid",
              "description": "更正禮金的接待人員識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            }
          },
          "required": [
            "amount",
            "guestId",
            "updatedBy",
            "weddingId"
          ]
        },
        "label": "禮金已更正",
        "description": "接待端更正賓客禮金金額"
      },
      {
        "name": "CakeBoxDistributed",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "領取喜餅的賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "cakeBoxTypeId": {
              "type": "string",
              "title": "款式 ID",
              "format": "uuid",
              "description": "發放的喜餅款式識別碼"
            },
            "distributedBy": {
              "type": "string",
              "title": "發放者 ID",
              "format": "uuid",
              "description": "登記發放的接待人員識別碼"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "cakeBoxTypeId",
            "distributedBy"
          ]
        },
        "label": "喜餅已發放",
        "description": "接待端登記賓客喜餅已發放"
      },
      {
        "name": "BlessingSubmitted",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "提交祝福的賓客識別碼"
            },
            "message": {
              "type": "string",
              "title": "祝福留言",
              "description": "祝福文字內容"
            },
            "photoUrl": {
              "type": "string",
              "title": "照片 URL",
              "format": "uri",
              "description": "上傳的照片連結"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "blessingId": {
              "type": "string",
              "title": "祝福 ID",
              "format": "uuid",
              "description": "祝福唯一識別碼"
            }
          },
          "required": [
            "guestId",
            "message",
            "photoUrl",
            "weddingId",
            "blessingId"
          ]
        },
        "label": "祝福已提交",
        "description": "賓客透過 LIFF 提交祝福留言或照片"
      },
      {
        "name": "BlessingApproved",
        "data": {
          "type": "object",
          "properties": {
            "approvedBy": {
              "type": "string",
              "title": "審核者 ID",
              "format": "uuid",
              "description": "審核通過的人員識別碼"
            },
            "blessingId": {
              "type": "string",
              "title": "祝福 ID",
              "format": "uuid",
              "description": "被審核的祝福識別碼"
            }
          },
          "required": [
            "approvedBy",
            "blessingId"
          ]
        },
        "label": "祝福已審核通過",
        "description": "管理員或接待審核通過祝福留言"
      },
      {
        "name": "BlessingRejected",
        "data": {
          "type": "object",
          "properties": {
            "reason": {
              "type": "string",
              "title": "拒絕原因",
              "description": "拒絕的原因說明"
            },
            "blessingId": {
              "type": "string",
              "title": "祝福 ID",
              "format": "uuid",
              "description": "被拒絕的祝福識別碼"
            },
            "rejectedBy": {
              "type": "string",
              "title": "審核者 ID",
              "format": "uuid",
              "description": "審核拒絕的人員識別碼"
            }
          },
          "required": [
            "reason",
            "blessingId",
            "rejectedBy"
          ]
        },
        "label": "祝福已審核拒絕",
        "description": "管理員或接待拒絕祝福留言"
      },
      {
        "name": "ThankYouCardTemplateSet",
        "data": {
          "type": "object",
          "properties": {
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "templateContent": {
              "type": "string",
              "title": "範本內容",
              "description": "謝卡的預設感謝文字內容"
            },
            "templateImageUrl": {
              "type": "string",
              "title": "範本圖片",
              "format": "uri",
              "description": "謝卡的背景圖片 URL"
            }
          },
          "required": [
            "weddingId",
            "templateContent",
            "templateImageUrl"
          ]
        },
        "label": "謝卡範本已設定",
        "description": "管理員設定謝卡範本內容"
      },
      {
        "name": "ThankYouCardCustomized",
        "data": {
          "type": "object",
          "properties": {
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "customContent": {
              "type": "string",
              "title": "客製內容",
              "description": "為此賓客客製的謝卡文字"
            }
          },
          "required": [
            "guestId",
            "weddingId",
            "customContent"
          ]
        },
        "label": "謝卡已客製",
        "description": "管理員為個別賓客客製謝卡內容"
      },
      {
        "name": "ThankYouBatchSent",
        "data": {
          "type": "object",
          "properties": {
            "sentAt": {
              "type": "string",
              "title": "發送時間",
              "format": "date-time",
              "description": "群發執行時間"
            },
            "sentBy": {
              "type": "string",
              "title": "發送者 ID",
              "format": "uuid",
              "description": "執行群發的管理員識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            },
            "recipientCount": {
              "type": "integer",
              "title": "發送人數",
              "minimum": 0,
              "description": "成功發送的賓客人數"
            }
          },
          "required": [
            "sentAt",
            "sentBy",
            "weddingId",
            "recipientCount"
          ]
        },
        "label": "感謝訊息已群發",
        "description": "婚禮後透過 LINE Bot 群發感謝訊息"
      },
      {
        "name": "ThankYouFallbackSent",
        "data": {
          "type": "object",
          "properties": {
            "sentAt": {
              "type": "string",
              "title": "發送時間",
              "format": "date-time",
              "description": "發送時間"
            },
            "channel": {
              "enum": [
                "email",
                "link"
              ],
              "type": "string",
              "title": "發送管道",
              "description": "替代管道類型"
            },
            "guestId": {
              "type": "string",
              "title": "賓客 ID",
              "format": "uuid",
              "description": "目標賓客識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮識別碼"
            }
          },
          "required": [
            "sentAt",
            "channel",
            "guestId",
            "weddingId"
          ]
        },
        "label": "替代感謝已發送",
        "description": "對未加 LINE 好友的賓客發送替代感謝（Email 或謝卡連結）"
      },
      {
        "name": "WeddingSoftDeleted",
        "data": {
          "type": "object",
          "properties": {
            "deletedBy": {
              "type": "string",
              "title": "刪除者 ID",
              "format": "uuid",
              "description": "執行刪除的使用者識別碼"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "被軟刪除的婚禮識別碼"
            }
          },
          "required": [
            "deletedBy",
            "weddingId"
          ]
        },
        "label": "婚禮已軟刪除",
        "description": "婚禮資料軟刪除（可回復）"
      },
      {
        "name": "WeddingRestored",
        "data": {
          "type": "object",
          "properties": {
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "被恢復的婚禮識別碼"
            },
            "restoredBy": {
              "type": "string",
              "title": "恢復者 ID",
              "format": "uuid",
              "description": "執行恢復的使用者識別碼"
            }
          },
          "required": [
            "weddingId",
            "restoredBy"
          ]
        },
        "label": "婚禮已恢復",
        "description": "已軟刪除的婚禮資料恢復"
      }
    ],
    "commands": [
      {
        "name": "RegisterAdmin",
        "label": "註冊管理員",
        "description": "管理員（新人/主辦）完成帳號註冊",
        "producesEvent": "AdminRegistered",
        "schema": {
          "type": "object",
          "required": [
            "userId",
            "email",
            "displayName"
          ],
          "properties": {
            "email": {
              "type": "string",
              "title": "電子郵件",
              "format": "email",
              "description": "電子郵件"
            },
            "userId": {
              "type": "string",
              "title": "使用者 ID",
              "format": "uuid",
              "description": "使用者 ID"
            },
            "displayName": {
              "type": "string",
              "title": "顯示名稱",
              "description": "顯示名稱"
            }
          }
        }
      },
      {
        "name": "CreateWedding",
        "label": "建立婚禮",
        "description": "管理員建立新的婚禮場次",
        "producesEvent": "WeddingCreated",
        "schema": {
          "type": "object",
          "required": [
            "weddingId",
            "title",
            "venue",
            "address",
            "date"
          ],
          "properties": {
            "date": {
              "type": "string",
              "title": "婚禮日期",
              "format": "date-time",
              "description": "婚禮日期"
            },
            "title": {
              "type": "string",
              "title": "婚禮名稱",
              "description": "婚禮名稱"
            },
            "venue": {
              "type": "string",
              "title": "婚宴場地",
              "description": "婚宴場地"
            },
            "address": {
              "type": "string",
              "title": "場地地址",
              "description": "場地地址"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮 ID"
            }
          }
        }
      },
      {
        "name": "UpdateWeddingInfo",
        "label": "更新婚禮資訊",
        "description": "管理員更新婚禮資訊（時間、地點、交通指引等）",
        "producesEvent": "WeddingInfoUpdated",
        "schema": {
          "type": "object",
          "required": [
            "weddingId",
            "date",
            "venue",
            "address",
            "transportInfo",
            "parkingInfo",
            "mapLink"
          ],
          "properties": {
            "date": {
              "type": "string",
              "title": "婚禮日期",
              "format": "date-time",
              "description": "婚禮日期"
            },
            "venue": {
              "type": "string",
              "title": "婚宴場地",
              "description": "婚宴場地"
            },
            "address": {
              "type": "string",
              "title": "場地地址",
              "description": "場地地址"
            },
            "mapLink": {
              "type": "string",
              "title": "地圖連結",
              "format": "uri",
              "description": "地圖連結"
            },
            "weddingId": {
              "type": "string",
              "title": "婚禮 ID",
              "format": "uuid",
              "description": "婚禮 ID"
            },
            "parkingInfo": {
              "type": "string",
              "title": "停車資訊",
              "description": "停車資訊"
            },
            "transportInfo": {
              "type": "string",
              "title": "交通指引",
              "description": "交通指引"
            }
          }
        }
      },
      {
        "name": "ConnectLineOa",
        "label": "連結 LINE 官方帳號",
        "description": "管理員將 LINE 官方帳號連結至婚禮",
        "producesEvent": "LineOaConnected",
        "schema": {
          "type": "object",
          "required": [
            "weddingId",
            "channelId",
            "oaName"
          ],
